import { Metadata } from "next";
import Link from "next/link";

export const metadata: Metadata = {
  title: "Terms",
  description: "Terms",
	category: "terms",
	alternates: {
		canonical: "/ms/terms"
	},
	referrer: "strict-origin-when-cross-origin",
	creator: "wmgcat",
	robots: {
		index: false,
		follow: false,
		nocache: false
	}
};

export default async function Terms() {
	return (
		<>
			<Link
				href="/ms"
				className="w-fit hover:underline cursor-pointer hover:opacity-60 text-xl"
			>
				Назад
			</Link>
			<h1 className="text-[#f9c629]! text-3xl">Пользовательское соглашение</h1>
			<h2 className="text-2xl">Пользовательское соглашение</h2>
			<p>Настоящие Пользовательское соглашение (далее - Соглашение) регулирует отношения между Администрацией сайта wmgcat.net и пользователем сети Интернет.</p>
			<h3 className="text-xl">1. Общие положения</h3>
			<p>1.1. Использование сайта wmgcat.net означает полное и безоговорочное принятие (акцепт) условий настоящего Соглашения</p>
			<p>1.2. Администрация оставляет за собой право в любое время изменять, дополнять или удалять пункты настоящего Соглашения без предварительного уведомления пользователя.</p>
			<p>1.3. Продолжение использования сайта после внесения изменений означает согласие с такими изменениями.</p>
			<h3 className="text-xl">2. Термины и определения</h3>
			<p>2.1. Сайт - интернет-ресурс, расположенный по адресу wmgcat.net.</p>
			<p>2.2. Администрация - правообладатель или уполномоченные лица, управляющие сайтом.</p>
			<p>2.3. Пользователь - дееспособное физическое лицо, получившее доступ к сайту посредством сети Интернет.</p>
			<h3 className="text-xl">3. Предмет соглашения</h3>
			<p>3.1. Администрация предоставляет пользователю право на использование сайта и его функционала в личных, некоммерческих целях в соответствии с условиями Соглашения.</p>
			<h3 className="text-xl">4. Права и обязанности сторон</h3>
			<p>4.1. Пользователь имеет право:</p>
			<ul className="pl-4 list-disc">
				<li>Получать доступ к информации и сервисам сайта.</li>
				<li>Задавать вопросы администрации по работе ресурса</li>
			</ul>
			<p>4.2. Пользователь обязуется:</p>
			<ul className="pl-4 list-disc">
				<li>Не распространять недостоверную информацию, спам, вредоносное ПО или контент, нарушающий законодательство.</li>
				<li>Не нарушать работоспособность сайта и не пытаться получить несанкционированный доступ к серверам.</li>
			</ul>
			<p>4.3. Администрация имеет право:</p>
			<ul className="pl-4 list-disc">
				<li>В одностороннем порядке ограничивать доступ к сайту или удалять аккаунт пользователя при нарушении условий Соглашения.</li>
				<li>Изменять оформление сайта, его структуру и список сервисов.</li>
			</ul>
			<h3 className="text-xl">5. Ответственность сторон</h3>
			<p>5.1. Сайт предоставляется по принципу &quot;как есть&quot; (as is). Администрация не гарантирует абсолютную бесперебойность работы ресурса.</p>
			<p>5.2. Администрация не несет ответственности за прямой или косвенный ущерб, возникший у пользователя из-за использования или невозможности использования сайта.</p>
			<h3>6. Заключительные положения</h3>
			<p>6.1. Все возможные споры из настоящего Соглашения разрешаются согласно действующему законодательству.</p>
			<p>6.2. Бездействие со стороны Администрации в случае нарушения пользователем пунктов Соглашения не лишает ее права предпринять соответствующие действия позже.</p>
			<h3 className="text-xl">7. Платежи и возврат средств</h3>
			<p>7.1. В случае возникновения вопросов, претензий, а также по вопросам осуществления платежей и возврата денежных средств, Пользователь может обратиться к Администрации по указанным ниже контактам.</p>
			<p>7.2. В случае ошибки при заполнении данных Пользователь может обратиться к Администрации с подтвержденной оплатой для корректирования данных на сервере, либо запросить возврат средств</p>
			<p>7.3. Если услуга была оказана по введенному коду (Без проведения оплаты), возврат средств за услугу невозможен. В таком случае услуга считается подарком.</p>
			<p className="text-xl text-[#f9c629]!">Контакты:</p>
			<ul className="pl-4 list-disc">
				<li>ИНН: 770307625408</li>
				<li>Адрес электронной почты (Email): developer@wmgcat.net</li>
			</ul>
		</>
	);
}
